#ifndef _TAG_CONST_H_
#define _TAG_CONST_H_
///////////////////////////////////////////////////////////////////////////////
// ============================================================================
// 상수 선언부
// ----------------------------------------------------------------------------
// 프로그램에서 사용하는 상수를 선언하여 사용하도록 한다.
// ============================================================================
///////////////////////////////////////////////////////////////////////////////

// ----------------------------------------------------------------------------
// Registry 조회를 위하여 관련값들을 Define함
// ----------------------------------------------------------------------------
#define		_REGFILE					_T("Update.reg")
#define		_UPDATEFILE					_T("Update.bat")

#define		_DEF_EXERELEPATH			_T("C:\\T1ATM\\APP\\EXERELE")
#define		_DEF_UPDATEPATH				_T("C:\\UPDATE")
#define		_DEF_APUPDATEPATH			_T("C:\\APUPDATE")
#define		_DEFAULT_OKIPATH			_T("C:\\ATM\\DRVSP\\EXE")// for OKI BRM SP Folder

// ----------------------------------------------------------------------------
// 레지스트리 입출력을 위한 Type값 설정
// ----------------------------------------------------------------------------
#define		REG_BIN						REG_BINARY
#define		REG_INT						REG_DWORD_LITTLE_ENDIAN
#define		REG_STR						REG_SZ
#define		REG_MULTI					REG_MULTI_SZ

// Tags
#define		ON							_T("ON")
#define		OFF							_T("OFF")


// ============================================================================
///////////////////////////////////////////////////////////////////////////////
#endif // _TAG_CONST_H_
