/////////////////////////////////////////////////////////////////////////////
#if !defined(_DEVDEFINE_H_INCLUDED_)
#define _DEVDEFINE_H_INCLUDED_

/////////////////////////////////////////////////////////////////////////////
// Version
/////////////////////////////////////////////////////////////////////////////
// Common C0001 : 2007.11.01 :	1. CDU-M REJECT COUNT UPDATE(SP)
//								2. MCU, CDU 82160 ERROR LOGIC UPDATE(DEVICE)
//								3. DEVICE_NO_RECOVERY_NONE(DEVICE)
//								4. ATM ID PRINT(REARAP) 
// Common C0002 : 2007.11.06 :	1. CDU-M CLOSE SHUTTER(DEVICE)
// Common C0003 : 2007.12.11 :	1. NCD MAC(DEVICE)
//								2. PIN BLOCK SYNC(MWI)
// Common C0004 : 2008.01.11 :	1. PIN BLOCK RETRY COUNT(DEVICE)
//								2. MCU SANKYO ANTISKIMMING(DEVICE)
// Common C0005 : 2008.01.31 :	1. TTW2E, MCD4E(DEVICE)
// Common C0006 : 2008.02.04 :	1. MX8000T(DEVICE)
// Common C0006 : 2008.03.28 :	1. MCU INITIAL(MWI)
//								2. PRINT IMAGE(MWI)
//								3. SPR/JPR PAPER OPTION(DEVICE)
//								4. CDU EP/SP LOG OPTION(DEVICE)
// Common C0007 : 2008.09.22 :	1. ATM+CD MERGE
// Common C0008 : 2008.10.28 :	1. MX8000L(DEVICE)
// Common C0009 : 2009.01.19 :	1. CDU/CIM OPEN RETRY(MWI)
// Common C0010 : 2009.08.25 :	1. MX5600T
//				  2009.10.21 :	2. MX5600L
// Common C0011 : 2010.08.24 :	1. CRM RETRACT ROUTER(CDU,BRM)
// Common C0012 : 2010.10.20 :	1. FORCE RETRACT(CDU)
//								2. MWI ERROR CODE UPDATE(400FF)

//	Cash Move Information
/////////////////////////////////////////////////////////////////////////////
#define REFILL_MOVE			0x01
#define TAKEUP_MOVE			0x02

#define CSH_AUTOLOAD		0x10
#define CSH_MANUALLOAD		0x20
#define CSH_RESET			0x40
#define CSH_LOST			0x80

/////////////////////////////////////////////////////////////////////////////
//	Language Mode
/////////////////////////////////////////////////////////////////////////////
#define CHN_MODE			0						// CHINA
#define ENG_MODE			1						// ENGLISH
#define KOR_MODE			2						// KOREA
#define JPN_MODE			3						// JAPAN

/////////////////////////////////////////////////////////////////////////////
//	TranCtrl Return Value
/////////////////////////////////////////////////////////////////////////////
#define T_OK				0						// OK
#define T_EXIT				1						// EXIT
#define T_CANCEL			2						// CANCEL
#define T_TIMEOVER			3						// TIME OVER
#define T_INPUTOVER			4						// INPUT OVER
#define T_INPUTERROR		5						// INPUT ERROR
#define T_ERROR				6						// DEVICE  ERROR(DEVICE ERROR MSG)
#define T_SENDERROR			7						// SEND    ERROR(BALANCE CONFIRM MSG)
#define T_RECVERROR			8						// RECV    ERROR(BALANCE CONFIRM MSG)
#define T_PROGRAM			98						// PROGRAM ERROR(REQUEST BANK)
#define T_MSG				99						// CANCEL(MSG)

/////////////////////////////////////////////////////////////////////////////
//	Screen Button Information
/////////////////////////////////////////////////////////////////////////////
#define S_RETURN			"RETURN"				// RETURN
#define S_EXIT				"EXIT"					// EXIT
#define S_CANCEL			"CANCEL"				// CANCEL
#define S_TIMEOVER			"TIMEOVER"				// TIME OVER
#define S_INPUTOVER			"INPUTOVER"				// INPUT OVER

#define S_CONTINUE			"CONTINUE"				// CONTINUE
#define S_CONFIRM			"CONFIRM"				// CONFIRM
#define S_CHANGE			"CHANGE"				// CHANGE
#define S_MODIFY			"MODIFY"				// MODIFY
#define S_CLEAR				"CLEAR"					// CLEAR
#define S_OTHER				"OTHER"					// OTHER
#define	S_YES				"YES"					// YES
#define	S_NO				"NO"					// NO
#define	S_PAY1				"PAY1"					// NO
#define	S_PAY2				"PAY2"					// NO
#define	S_ACREMIT			"TRANPAY"				// 转账汇款
#define	S_ACPAY		    	"PAY"			    	// 管家婆缴费
#define S_ENTER             "ENTER"
#define	S_INCREASE			"INCREASE"				// INCREASE
#define	S_AGAIN				"AGAIN"					// AGAIN

#define S_REMIT_ADD			"ADDRESSPAY"
#define S_REMIT_PWD			"PINPAY"
#define S_REMIT_IN			"REMITPAY"

//20080905 by yaokq
#define S_Previous			"PREVIOUS"				//上一页
#define S_NEXT				"NEXT"					//下一页
/////////////////////////////////////////////////////////////////////////////
//	Op Result
/////////////////////////////////////////////////////////////////////////////
#define OP_DO				"DO"					// DO
#define OP_NORMAL			"NORMAL"				// NORMAL
#define OP_ERROR			"ERROR"					// ERROR

/////////////////////////////////////////////////////////////////////////////
//	Card Information
/////////////////////////////////////////////////////////////////////////////
typedef struct	tagISO2Form
{
	BYTE MembershipNo[16];							// 000
	BYTE Seperator;									// 016
	BYTE EndDay[4];									// 017
	BYTE ServiceNo[3];								// 021
	BYTE ScrambleNo[4];								// 024
	BYTE Dummy[228];								// 028(256)
} MCISO2;

typedef struct	tagISO3Form
{
	BYTE FormatCode[2]; 							// 000
	BYTE IdNo[2]; 									// 002
	BYTE BankNo[3];									// 004
	BYTE Separator1;								// 007
	BYTE AccountNo[16];								// 008
	BYTE AccountCheck;								// 024
	BYTE Separator2;								// 025
	BYTE Nation[3]; 								// 026
	BYTE CashCode[3];								// 029
	BYTE Unknown1[15];								// 032
	BYTE ValidCode;									// 047
	BYTE Password[6];								// 048
	BYTE Trade;										// 054
	BYTE Tran1[2];									// 055
	BYTE Tran2[4];									// 057
	BYTE OtherData[27];								// 061
	BYTE Remark[16];								// 088
	BYTE Dummy[152];								// 104(256)
} MCISO3;

/////////////////////////////////////////////////////////////////////////////
//	Pb Information
/////////////////////////////////////////////////////////////////////////////
typedef struct	tagPBMSForm
{
	BYTE AccountNo[17];								// 000
	BYTE Filler[239];								// 017(256)
} PBMS;

/////////////////////////////////////////////////////////////////////////////
//	Magnetic Card Area
/////////////////////////////////////////////////////////////////////////////
typedef struct	tagMCVW 
{
	BYTE TrInfo;
	WORD JISsize;
	BYTE JISBuff[256];         
	WORD ISO1size;               
	BYTE ISO1Buff[256];     
	WORD ISO2size;              
	BYTE ISO2Buff[256];    
	WORD ISO3size;             
	BYTE ISO3Buff[256];   
} MCAP;

/////////////////////////////////////////////////////////////////////////////
//	Magnetic Pb Area
/////////////////////////////////////////////////////////////////////////////
typedef struct tagMS 
{
	WORD Len;
	BYTE sBuf[256];
} MS;

/////////////////////////////////////////////////////////////////////////////
// DepositMoney Area
/////////////////////////////////////////////////////////////////////////////
typedef	struct tagDEPOSIT_MONEY 
{
