/////////////////////////////////////////////////////////////////////////////
#if !defined(_TranCmnUser_H_)
#define _TranCmnUser_H_

/////////////////////////////////////////////////////////////////////////////
//	IOS3
/////////////////////////////////////////////////////////////////////////////
// 000	FormatCode[2]			
// 002	IdNo[2]			
// 004	BankNo[3]			
// 007	Separator1[1]			
// 008	AccountNo[16]	
// 024	AccountCheck[1]			
// 025	Separator2[1]			
// 026	Nation[3]			
// 029	CashCode[3]			
// 032	Unknown1[15]				
// 047	ValidCode[1]		
// 048	PassWord[6]			
// 054	Trade[1]				
// 055	Tran1[2]			
// 057	Tran2[4]			
// 061	OtherData[27]		
// 088	Remark[16]		
// 104	Dummy[22]		
/////////////////////////////////////////////////////////////////////////////
													// CardBank
#define	OTHERBANKCARD		0						// Other Bank Card
#define	MOTHERBANKCARD		1						// Mother Bank Card

/////////////////////////////////////////////////////////////////////////////
//	IOS2
/////////////////////////////////////////////////////////////////////////////
// 000	MembershipNo[16]	
// 016	Seperator[1]	
// 017	EndDay[4]		
// 021	ServiceNo[3]		
// 024	ScrambleNo[4]		
// 028	Dummy[18]			
/////////////////////////////////////////////////////////////////////////////
													// CardService
#define	OTHERSERVICECARD	0						// Other Service Card
#define	MOTHERSERVICECARD	1						// Mother Service Card

/////////////////////////////////////////////////////////////////////////////
//	Transaction Message Table
/////////////////////////////////////////////////////////////////////////////
static char TranMsgTbl[][2][256] = {
		   //0123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789
			"",													// CHINA
			"",													// ENGLISH 

		   //0123456789012345678901234567890123456789			// 1 : 2004.11.05
//KOR		"[ 救  郴 ]\n\n墨靛 佬扁啊 角菩窍看嚼聪促\n贸澜何磐 促矫 窍咯林绞矫坷",
			"[提示信息]\n您插入的磁卡无效\n\n[INFOMATION]\nCARD READ ERROR, PLEASE RETRY\n",
			"",

		   //0123456789012345678901234567890123456789			// 2 : 2004.11.05
//KOR		"[ 救  郴 ]\n\n秦寸 概眉 佬扁啊 角菩窍看嚼聪促\n贸澜何磐 促矫 窍咯林绞矫坷",
			"[提示信息]\n读取媒介信息失败, 请重试\n\n[INFOMATION]\nMATERIAL READ ERROR, PLEASE RETRY\n",
			"",

		   //0123456789012345678901234567890123456789			// 3 : 2004.11.05
//KOR		"[ 救  郴 ]\n\n烹厘 佬扁啊 角菩窍看嚼聪促\n贸澜何磐 促矫 窍咯林绞矫坷",
			"[提示信息]\n读存折失败, 请重试\n\n[INFOMATION]\nPASSBOOK READ ERROR, PLEASE RETRY\n",
			"",

		   //0123456789012345678901234567890123456789			// 4
//KOR		"[ 救  郴 ]\n\n秦寸 诀公绰 氢饶 辑厚胶 抗沥涝聪促",
			"[提示信息]\n此功能暂不支持\n\n[INFOMATION]\nTRANSACTION HAS BEEN CANCELLED\n",
			"",

		   //0123456789012345678901234567890123456789			// 5
//KOR		"[ 救  郴 ]\n\n墨靛,烹厘 悼矫 荤侩捞 阂啊钦聪促",
			"[提示信息]\n磁卡和存折不能同时使用\n\n[INFOMATION]\nTRANSACTION HAS BEEN CANCELLED\n",
			"",

		   //0123456789012345678901234567890123456789			// 6
//KOR		"[ 救  郴 ]\n\n捞 墨靛肺绰 夯芭贰甫 且 荐 绝嚼聪促",
			"[提示信息]\n用此卡不能做此交易\n\n[INFOMATION]\nYOUR CARD CAN NOT\nBE USED AT THIS TRANSACTION",
			"",

		   //0123456789012345678901234567890123456789			// 7
//KOR		"[ 救  郴 ]\n\n捞 烹厘栏肺绰 夯芭贰甫 且 荐 绝嚼聪促",
			"[提示信息]\n用此存折不能做此交易\n\n[INFOMATION]\nYOUR PASSBOOK CAN NOT\nBE USED AT THIS TRANSACTION",
			"",

		   //0123456789012345678901234567890123456789			// 8
//KOR		"[ 救  郴 ]\n\n芭贰啊 阂啊钦聪促\n促澜俊 捞侩 官而聪促",
			"[提示信息]\n暂时无法做交易, 请稍后使用\n\n[INFOMATION]\nTRANSACTION IS NOT VALID\n\n",
			"",

		   //0123456789012345678901234567890123456789			// 9
//KOR		"[ 救  郴 ]\n\n秒家贸府啊 阂啊钦聪促\n芒备俊 巩狼窍咯 林绞矫坷",
			"[提示信息]\n无法做取消处理, 请咨询柜台\n\n[INFOMATION]\nTRANSACTION IS NOT VALID\n",
			"",

		   //0123456789012345678901234567890123456789			// 10
//KOR		"[ 救  郴 ]\n\n芭贰啊 辆丰 登菌嚼聪促",
			"[提示信息]\n交易被取消\n\n[INFOMATION]\nTRANSACTION HAS BEEN CANCELLED\n",
			"",

		   //0123456789012345678901234567890123456789			// 11
//KOR		"[ 救  郴 ]\n\n芭贰啊 秒家 登菌嚼聪促\n贸澜何磐 促矫 窍咯林绞矫坷",
			"[提示信息]\n交易被取消, 请重新开始\n\n[INFOMATION]\nTRANSACTION HAS BEEN CANCELLED\nPLEASE TRY AGAIN",
			"",

		   //0123456789012345678901234567890123456789			// 12
//KOR		"[ 救  郴 ]\n\n矫埃捞 檬苞 窍看嚼聪促\n贸澜何磐 促矫 窍咯林绞矫坷",
			"[提示信息]\n操作时间超时, 请重新开始\n\n[INFOMATION]\nINPUT TIMEOVER, PLEASE TRY AGAIN",
			"",

		   //0123456789012345678901234567890123456789			// 13
//KOR		"[ 救  郴 ]\n\n涝仿 冉荐甫 檬苞 窍看嚼聪促\n贸澜何磐 促矫 窍咯林绞矫坷",
			"[提示信息]\n输入次数超限, 请重新开始\n\n[INFOMATION]\nINPUT TRIES EXCEEDED\nPLEASE TRY AGAIN",
			"",

		   //0123456789012345678901234567890123456789			// 14
//KOR		"[ 救  郴 ]\n\n涝仿磊丰 捞惑 惯积\n芒备俊 巩狼窍咯 林绞矫坷",
			"[提示信息]\n输入数据异常, 请咨询柜台\n\n[INFOMATION]\nINPUT DATA ERROR, PLEASE INQUIRY",
			"",

		   //0123456789012345678901234567890123456789			// 15
//KOR		"[ 救  郴 ]\n\n厘局啊 惯积 窍看嚼聪促\n儡咀阑 犬牢窍咯 林绞矫坷",
			"[提示信息]\n交易失败, 请确认您的余额\n\n[INFOMATION]\nTRANSACTION HAS BEEN CANCELLED\nPLEASE CHECK YOUR ACCOUNT BALANCE",
			"",

		   //0123456789012345678901234567890123456789			// 16
//KOR		"[ 救  郴 ]\n\n儡咀阑 犬牢窍咯 林绞矫坷",
			"[提示信息]\n请确认您的余额\n\n[INFOMATION]\nPLEASE CHECK YOUR ACCOUNT BALANCE\n",
			"",

		   //0123456789012345678901234567890123456789			// 17
//KOR		"[ 救  郴 ]\n\n贸府吝 厘局啊 惯积窍看嚼聪促",
			"[提示信息]\n系统维护,暂不能交易,请稍后再试\n\n[INFOMATION]\nTRANSACTION HAS BEEN CANCELLED\n",
			"",

		   //0123456789012345678901234567890123456789			// 18
//KOR		"[ 救  郴 ]\n\n橇肺弊伐 捞惑 惯积\n芒备俊 巩狼窍咯 林绞矫坷",
			"[提示信息]\n程序异常, 交易被取消\n\n[INFOMATION]\nPROGRAM ABNORMAL\nTRANSACTION HAS BEEN CANCELLED",
			"",

		   //0123456789012345678901234567890123456789			// 19
//KOR		"[ 救  郴 ]\n\n免陛捞 阂啊 钦聪促",
			"[提示信息]\n程序异常, 暂时不能做取款\n\n[INFOMATION]\nWITHDRAWAL IS NOT VALID\n",
			"",

		   //0123456789012345678901234567890123456789			// 20
//KOR		"[ 救  郴 ]\n\n涝仿陛咀 檬苞涝聪促",
			"[提示信息]\n取款金额超限, 交易被取消\n\n[INFOMATION]\nTRANSACTION HAS BEEN CANCELLED\n",
			"",

		   //0123456789012345678901234567890123456789			// 21
//KOR		"[ 救  郴 ]\n\n捞眉 涝仿陛咀 檬苞涝聪促",
			"[提示信息]\n转帐金额超限, 交易被取消\n\n[INFOMATION]\nTRANSACTION HAS BEEN CANCELLED\n",
			"",			

		   //0123456789012345678901234567890123456789			// 22
//KOR		"[ 救  郴 ]\n\n捞 墨靛肺绰 秦寸 磊悼扁俊辑 荤侩捞 阂啊 钦聪促",
			"[提示信息]\n此卡无法在此柜员机上使用\n\n[INFOMATION]\nTHE CARD CAN NOT BE USED AT THIS MACHINE\n",
			"",

			//0123456789012345678901234567890123456789			// 23
//KOR		"[ 救  郴 ]\n\n捞 墨靛肺绰 秦寸 磊悼扁俊辑 荤侩捞 阂啊 钦聪促",
			"[提示信息]\n账号输入次数超限, 请重新插卡\n\n[INFOMATION]\nINPUT TRIES EXCEEDED\nPLEASE TRY AGAIN\n",
			"",

			//0123456789012345678901234567890123456789			// 24
//KOR		"[ 救  郴 ]\n\n捞 墨靛肺绰 秦寸 磊悼扁俊辑 荤侩捞 阂啊 钦聪促",
			"[提示信息]\n服务因故未能完成，请与银行联系\n\n[INFOMATION]\nINPUT TRIES EXCEEDED\nPLEASE TRY AGAIN\n",
			"",

			//0123456789012345678901234567890123456789			// 25
//KOR		"[ 救  郴 ]\n\n捞 墨靛肺绰 秦寸 磊悼扁俊辑 荤侩捞 阂啊 钦聪促",
			"[提示信息]\n没有可选择的应用，请与银行联系\n\n[INFOMATION]\nINPUT TRIES EXCEEDED\nPLEASE TRY AGAIN\n",
			"",

			//0123456789012345678901234567890123456789			// 26
//KOR		"[ 救  郴 ]\n\n捞 墨靛肺绰 秦寸 磊悼扁俊辑 荤侩捞 阂啊 钦聪促",
			"[提示信息]\n选择应用失败\n\n[INFOMATION]\nINPUT TRIES EXCEEDED\nPLEASE TRY AGAIN\n",
			"",




		   //0123456789012345678901234567890123456789			// NNN
//KOR		"",
			"",													// CHINA
			""													// ENGLISH 
};

/////////////////////////////////////////////////////////////////////////////
//	Host Ng Message Table
/////////////////////////////////////////////////////////////////////////////
typedef struct tagHostNg
{
	char	Code[3];
	char	Msg[2][256];
} HostNg;

static HostNg HostNgTbl[] = {	
			//0123456789012345678901234567890123456789			// 0
			"",													// NG CODE
			"",													// CHINA
			"",													// ENGLISH 

/////////////////////////////////////////////////////////////////////////////
			
			//0123456789012345678901234567890123456789			// 4			
			"04",												// NG CODE
			"[提示信息]\n\n帐号不存在\n[INFOMATION]\nNon-existing account number.",		//显示3、5行  BY WBL 2010.11.03
			"",
			
			//0123456789012345678901234567890123456789			// 5			
			"05",												// NG CODE
			"[提示信息]\n\n您的余额不足\n[INFOMATION]\nNot sufficient funds.",
			"",
			//by wbl 2010.11.2
			//0123456789012345678901234567890123456789			// 6			
			"06",												// NG CODE
			"[提示信息]\n\n您的余额不足\n[INFOMATION]\nNot sufficient funds.",
			"",

			//0123456789012345678901234567890123456789			// 7			
			"07",												// NG CODE
			"[提示信息]\n\n您的卡不能办理此交易\n[INFOMATION]\nTransaction not permitted.",
			"",

			//0123456789012345678901234567890123456789			// 8			
			"08",												// NG CODE
			"[提示信息]\n您的账户状态不正常，\n请与发卡行联系\n[INFOMATION]\nAbnormal account.\nPlease contact the card issuer.",
			"",
			
			//0123456789012345678901234567890123456789			// 9		
			"09",												// NG CODE
			"[提示信息]\n\n您的卡已被吞卡，请与发卡行联系\n[INFOMATION]\nCard retained. Please contact card issuer.",
			"",

			//0123456789012345678901234567890123456789			//10			
			"10",												// NG CODE
			"[提示信息]\n\n您的账户已冻结，冻结期内不能交易\n[INFOMATION]\nAccount blocked. \nNo transaction is allowed during blockage.",
			"",
			
			//0123456789012345678901234567890123456789			//11			
			"11",												// NG CODE
			"[提示信息]\n\n您的卡已被吞卡，请与发卡行联系\n[INFOMATION]\nCard retained. Please contact card issuer.",
			"",
						
			//0123456789012345678901234567890123456789			// 12			
			"12",												// NG CODE
			"[提示信息]\n\n您的余额不足\n[INFOMATION]\nNot sufficient funds.",
			"",
			
			//0123456789012345678901234567890123456789			// 13			
			"13",												// NG CODE
			"[提示信息]\n\n您的卡已被吞卡，请与发卡行联系\n[INFOMATION]\nCard retained. Please contact card issuer.",
			"",
			
			//0123456789012345678901234567890123456789			// 14			
			"14",												// NG CODE
			"[提示信息]\n\n您的卡已被吞卡，请与发卡行联系\n[INFOMATION]\nCard retained. Please contact card issuer.",
			"",

			//0123456789012345678901234567890123456789			// 17			
			"17",												// NG CODE
			"[提示信息]\n\n您的账户长期未使用，请至网点确认\n[INFOMATION]\nAccount unused for a long time.\nPlease reconfirm at the counter.",
			"",

			//0123456789012345678901234567890123456789			// 2S			
			"2S",												// NG CODE
			"[提示信息]\n\n您的转入账户不是结算账户，不能做转账业务\n[INFOMATION]\nUnable to transfer to non-clearing account",
			"",

			//0123456789012345678901234567890123456789			// 20			
			"20",												// NG CODE
			"[提示信息]\n\n您的卡已被吞卡，请与发卡行联系\n[INFOMATION]\nCard retained. Please contact card issuer.",
			"",
			
			//0123456789012345678901234567890123456789			// 21			
			"21",												// NG CODE
			"[提示信息]\n\n您的卡已被吞卡，请与发卡行联系\n[INFOMATION]\nCard retained. Please contact card issuer.",
			"",

			//0123456789012345678901234567890123456789			// 22			
			"22",												// NG CODE
			"[提示信息]\n您的卡状态不正常，\n请与发卡行联系\n[INFOMATION]\nAbnormal card. \nPlease contact the card issuer.",
			"",
						
			//0123456789012345678901234567890123456789			// 23			
			"23",												// NG CODE
			"[提示信息]\n\n您的卡已被吞卡，请与发卡行联系\n[INFOMATION]\nCard retained. Please contact card issuer.",
			"",

			//0123456789012345678901234567890123456789			// 23			
			"24",												// NG CODE
			"[提示信息]\n\n您的卡不能办理此交易\n[INFOMATION]\nTransaction not permitted.",
			"",
						
			//0123456789012345678901234567890123456789			// 25			
			"25",												// NG CODE
			"[提示信息]\n您的卡尚未激活，\n请修改密码以激活卡\n[INFOMATION]\nInactive card.\nPlease change your PIN to enable the card.",
			"",

			//0123456789012345678901234567890123456789			// 26			
			"26",												// NG CODE
			"[提示信息]\n\n您输入的密码有误，请重新输入\n[INFOMATION]\nIncorrect PIN. Please try again.",
			"",
			
			//0123456789012345678901234567890123456789			// 27			
			"27",												// NG CODE
			"[提示信息]\n您的密码输入错误次数超限\n请至网点办理密码解锁定手续\n[INFOMATION]\nExceeds allowable PIN tries. \nPlease unblock your PIN at the counter. ",
			"",
			
			//0123456789012345678901234567890123456789			// 30			
			"30",												// NG CODE
			"[提示信息]\n您的卡状态不正常，\n请与发卡行联系\n[INFOMATION]\nAbnormal card. \nPlease contact the card issuer.",
			"",

			//0123456789012345678901234567890123456789			// 31			
			"31",												// NG CODE
			"[提示信息]\n您的卡状态不正常，\n请与发卡行联系\n[INFOMATION]\nAbnormal card. \nPlease contact the card issuer.",
			"",
			
			//0123456789012345678901234567890123456789			// 59			
			"59",												// NG CODE
			"[提示信息]\n\n该交易必须在开户局办理\n[INFOMATION]\nThe transaction must be \nconducted at the opening bank of your account.",
			"",

			//0123456789012345678901234567890123456789			// 60			
			"60",												// NG CODE
			"[提示信息]\n\n您的卡不能办理此交易\n[INFOMATION]\nTransaction not permitted.",
			"",
						
			//0123456789012345678901234567890123456789			// 61			
			"61",												// NG CODE
			"[提示信息]\n\n请在开户地所在省办理此交易\n[INFOMATION]\nPlease conduct the transaction \nin province where the opening bank locates.",
			"",
			
			//0123456789012345678901234567890123456789			// 94			
			"94",												// NG CODE
			"[提示信息]\n\n请在开户地所在省办理此交易\n[INFOMATION]\nPlease conduct the transaction \nin province where the opening bank locates.",
			"",
/////////////////////////////////////////////////////////////////////////////
			
			//0123456789012345678901234567890123456789			// 105			
			"1F",												// NG CODE
			"[提示信息]\n您的当日ATM取款次数已超限\n如需取款请至网点办理\n[INFOMATION]\nExceeds withdrawal frequency limit in a day.\nPlease withdraw at the counter.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 106			
			"1G",												// NG CODE
			"[提示信息]\n\n您输入的金额有误，请重新交易\n[INFOMATION]\nIncorrect amount. Please try again.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 119			
			"1T",												// NG CODE
			"[提示信息]\n\n转账超时，请检查转入账户\n[INFOMATION]\nTransfer timeout. \nPlease check the transferee account.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 130			
			"2E",												// NG CODE
			"[提示信息]\n您在ATM上办理该业务金额超限，\n请到网点办理\n[INFOMATION]\nExceeds amount limit on the ATM.\nPlease transact at the counter.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 131			
			"2F",												// NG CODE
			"[提示信息]\n对不起，由于暂时缺钞\n不能做取款交易\n[INFOMATION]\nSorry, the machine is out of cash for withdrawal.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 133			
			"2H",												// NG CODE
			"[提示信息]\n交易超时,\n如有疑问请与发卡行联系\n[INFOMATION]\nTransaction timeout. \nPlease contact card issuer. ",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 134			
			"2I",												// NG CODE
			"[提示信息]\n\n账号不存在\n[INFOMATION]\nNon-existing account number.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 139			
			"2N",												// NG CODE
			"[提示信息]\n\n卡号无效\n[INFOMATION]\nInvalid card number.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 141			
			"2P",												// NG CODE
			"[提示信息]\n\n对不起，此交易尚未开通\n[INFOMATION]\nSorry, the serveice is not yet started. ",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 146			
			"2U",												// NG CODE
			"[提示信息]\n\n交易金额已超限，请重新交易\n[INFOMATION]\nExceeds transaction amount limit. \nPlease try again.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 147			
			"2V",												// NG CODE
			"[提示信息]\n您在ATM上办理该业务金额超限，\n请到网点办理\n[INFOMATION]\nExceeds amount limit on the ATM.\nPlease transact at the counter.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 148			
			"2W",												// NG CODE
			"[提示信息]\n您在ATM上办理该业务金额超限，\n请到网点办理\n[INFOMATION]\nExceeds amount limit on the ATM.\nPlease transact at the counter.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 149			
			"2X",												// NG CODE
			"[提示信息]\n\n您输入的金额有误，请重新交易\n[INFOMATION]\nIncorrect amount. Please try again.",
			"",
/////////////////////////////////////////////////////////////////////////////		

			//0123456789012345678901234567890123456789			// 252			
			"2Y",												// NG CODE
			"[提示信息]\n卡内转账交易超时,\n请查询帐户余额\n[INFOMATION]\nTransaction timeout. \nPlease check your account balance.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// 252			
			"2Z",												// NG CODE
			"[提示信息]\n转入金额低于最低起存金额,\n请重新输入\n[INFOMATION]\nTransfer amount lower than minimum initial deposit.\nPlease try again.",
			"",
/////////////////////////////////////////////////////////////////////////////	
			
			//0123456789012345678901234567890123456789			// 160			
			"A7",												// NG CODE
			"[提示信息]\n您输入的缴费号码不存在，\n请重新交易\n[INFOMATION]\nNon-existing number. Please try again.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 161			
			"A8",												// NG CODE
			"[提示信息]\n您输入的缴费号码不存在，\n请重新交易\n[INFOMATION]\nNon-existing number. Please try again.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 165			
			"B2",												// NG CODE
			"[提示信息]\n\n您的号码无欠费\n[INFOMATION]\nNo overdue balance for your number.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 166			
			"B3",												// NG CODE
			"[提示信息]\n\n您的缴费号码已冻结\n[INFOMATION]\nPayee number blocked.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 167			
			"B4",												// NG CODE
			"[提示信息]\n\n收费日期有误\n[INFOMATION]\nIncorrect collecting date.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 168			
			"B5",												// NG CODE
			"[提示信息]\n\n缴费户名不符\n[INFOMATION]\nIncorrect payee ID.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 170			
			"B7",												// NG CODE
			"[提示信息]\n\n输入信息不完整，请重新输入\n[INFOMATION]\nIncomplete information. Please try again.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 171			
			"B8",												// NG CODE
			"[提示信息]\n\n您输入的缴费金额有误，请重新交易\n[INFOMATION]\nIncorrect payment amount. Please try again.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 172			
			"B9",												// NG CODE
//			"[提示信息]\n\n缴费金额应大于等于最低应缴金额\n[INFOMATION]\nAmount lower than minimum payment. Please try again.",
			"[提示信息]\n\n缴费金额小于最低应缴金额，请重新交易\n[INFOMATION]\nAmount lower than minimum payment. Please try again.",
			"",
/////////////////////////////////////////////////////////////////////////////			
						
			//0123456789012345678901234567890123456789			// 173			
			"C0",												// NG CODE
			"[提示信息]\n\n此号码只能缴费，不能预存\n[INFOMATION]\nPayment only for this number.",
			"",
/////////////////////////////////////////////////////////////////////////////			
						
			//0123456789012345678901234567890123456789			// 174			
			"C1",												// NG CODE
			"[提示信息]\n\n此号码只能充值，不能缴费\n[INFOMATION]\nRecharge only for this number.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 175			
			"C2",												// NG CODE
			"[提示信息]\n\n无预存余额\n[INFOMATION]\nNo prepaid balance.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 176			
			"C3",												// NG CODE
			"[提示信息]\n\n无欠费\n[INFOMATION]\nNo overdue balance.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 177			
			"C4",												// NG CODE
			"[提示信息]\n\n无缴费纪录\n[INFOMATION]\nNo payment record.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 178			
			"C5",												// NG CODE
			"[提示信息]\n\n起始日期不能大于终止日期\n[INFOMATION]\nEnd date must be later than start date.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 179			
			"C6",												// NG CODE
			"[提示信息]\n\n对不起，暂不支持银联卡缴费\n[INFOMATION]\nTemporarily unable to\naccept payment with Unionpay cards.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 180			
			"C7",												// NG CODE
			"[提示信息]\n\n对不起，票已售完\n[INFOMATION]\nSorry, the tickets are out.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 181			
			"C8",												// NG CODE
			"[提示信息]\n\n输入信息不完整，请重新输入\n[INFOMATION]\nIncomplete information. Please try again.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 182			
			"C9",												// NG CODE
			"[提示信息]\n\n输入信息不完整，请重新输入\n[INFOMATION]\nIncomplete information. Please try again.",
			"",
/////////////////////////////////////////////////////////////////////////////			
						
			//0123456789012345678901234567890123456789			// 183			
			"D0",												// NG CODE
			"[提示信息]\n您输入的缴费号码不存在，\n请重新交易\n[INFOMATION]\nNon-existing number. Please try again.",
			"",
/////////////////////////////////////////////////////////////////////////////			
						
			//0123456789012345678901234567890123456789			// 184			
			"D1",												// NG CODE
			"[提示信息]\n收据/发票已打印，\n无未打印收据/发票\n[INFOMATION]\nReceipt printed.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 190			
			"E4",												// NG CODE
			"[提示信息]\n\n本机暂未开通汇兑业务\n[INFOMATION]\nNo remittance and cashing service at this terminal.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 191			
			"E5",												// NG CODE
			"[提示信息]\n您的卡账户状态异常，\n不能交易,请与发卡行联系\n[INFOMATION]\nAbnormal card account. \nPlease contact the card issuer.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 192			
			"E6",												// NG CODE
			"[提示信息]\n您的账户无预约汇款信息，\n请至网点办理\n[INFOMATION]\nNo remittance appointment. \nPlease remit at the counter.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 193			
			"E7",												// NG CODE
			"[提示信息]\n\n您的此笔汇款金额超限，请重新输入\n[INFOMATION]\nExceeds amount limit for a single remittance. \nPlease try again.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 194			
			"E8",												// NG CODE
			"[提示信息]\n\n您的汇款金额过低，请重新输入\n[INFOMATION]\nLow remittance amount. Please try again.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 195			
			"E9",												// NG CODE
			"[提示信息]\n您的当日汇款金额已超限\n如需汇款请至网点办理\n[INFOMATION]\nExceeds frequency limit of remittance in a day.\nPlease remit at the counter.",
			"",
/////////////////////////////////////////////////////////////////////////////			
						
			//0123456789012345678901234567890123456789			// 196			
			"F0",												// NG CODE
			"[提示信息]\n您的当日汇款次数已超限\n如需汇款请至网点办理\n[INFOMATION]\nExceeds amount limit of remittance in a day.\nPlease remit at the counter.",
			"",
/////////////////////////////////////////////////////////////////////////////			
						
			//0123456789012345678901234567890123456789			// 200			
			"F4",												// NG CODE
			"[提示信息]\n\n您输入的兑付密码有误，请重新输入\n[INFOMATION]\nIncorrect password to honor the check. \nPlease try again.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 201			
			"F5",												// NG CODE
			"[提示信息]\n\n您输入的汇票号码有误，请重新输入\n[INFOMATION]\nIncorrect draft number. Please try again.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 202			
			"F6",												// NG CODE
			"[提示信息]\n您输入的汇票号状态异常\n不可交易，请与邮局联系\n[INFOMATION]\nTransaction declined due to abnomal draft number.\nPlease contact the post office.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 203			
			"F7",												// NG CODE
			"[提示信息]\n您输入的汇票号状态异常\n不可交易，请与邮局联系\n[INFOMATION]\nTransaction declined due to abnomal draft number.\nPlease contact the post office.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 204			
			"F8",												// NG CODE
			"[提示信息]\n您输入的汇票号状态异常\n不可交易，请与邮局联系\n[INFOMATION]\nTransaction declined due to abnomal draft number.\nPlease contact the post office.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 205			
			"F9",												// NG CODE
			"[提示信息]\n您输入的汇票号状态异常\n不可交易，请与邮局联系\n[INFOMATION]\nTransaction declined due to abnomal draft number.\nPlease contact the post office.",
			"",
/////////////////////////////////////////////////////////////////////////////			
						
			//0123456789012345678901234567890123456789			// 207			
			"G1",												// NG CODE
			"[提示信息]\n您输入的汇票号状态异常\n不可交易，请与邮局联系\n[INFOMATION]\nTransaction declined due to abnomal draft number.\nPlease contact the post office.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 208		
			"G2",												// NG CODE
			"[提示信息]\n您输入的金额与原汇票金额不符\n请核对后重新输入\n[INFOMATION]\nDisagreement between key-in amount and\namount on the draft.Please check and try again.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 209			
			"G3",												// NG CODE
			"[提示信息]\n\n您的账户无汇款记录\n[INFOMATION]\nNo remittance record of your account.",
			"",
/////////////////////////////////////////////////////////////////////////////			
			
			//0123456789012345678901234567890123456789			// 210			
			"G4",												// NG CODE
			"[提示信息]\n\n您的账户无汇款信息\n[INFOMATION]\nNo remittance information about your account.",
			"",
/////////////////////////////////////////////////////////////////////////////		
      
			//0123456789012345678901234567890123456789			// 233			
			"Z1",												// NG CODE
			"[提示信息]\n交易超时,\n如有疑问请与发卡行联系\n[INFOMATION]\nTransaction timeout. \nPlease contact card issuer. ",
			"",
/////////////////////////////////////////////////////////////////////////////
      
			//0123456789012345678901234567890123456789			// 234			
			"Z2",												// NG CODE
			"[提示信息]\n交易超时,\n如有疑问请与发卡行联系\n[INFOMATION]\nTransaction timeout. \nPlease contact card issuer. ",
			"",
/////////////////////////////////////////////////////////////////////////////
      
			//0123456789012345678901234567890123456789			// 238			
			"Z6",												// NG CODE
			"[提示信息]\n\n您的卡状态不正常,请与发卡行联系\n[INFOMATION]\nAbnomal card. Please contact the card issuer.",
			"",
/////////////////////////////////////////////////////////////////////////////
      
			//0123456789012345678901234567890123456789			// 252			
			"3A",												// NG CODE
			"[提示信息]\n\n您的卡内子帐户个数超限\n[INFOMATION]\nExceeds maximum number of sub-accounts. ",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// 252			
			"3B",												// NG CODE
			"[提示信息]\n\n您的可用额度不足\n[INFOMATION]\nInsufficient available balance.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// 252			
			"3C",												// NG CODE
			"[提示信息]\n\n您输入的卡号为副卡,不能对副卡转账\n[INFOMATION]\nUnable to transfer to an additional card account.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// 252			
			"3D",												// NG CODE
			"[提示信息]\n整整子帐户未到期\n如需提前支取,请到网点办理\n[INFOMATION]\nSub-account is undue. Please transact\nat the counter,if you need draw in advance.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// 252			
			"3E",												// NG CODE
			"[提示信息]\n\n您输入的子帐户不存在,请重新输入\n[INFOMATION]\nNon-existing subaccount. Please try again.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// 252			
			"3F",												// NG CODE
			"[提示信息]\n\n您的卡已被吞卡,请与发卡行联系\n[INFOMATION]\nCard retained. Please contact card issuer. ",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// 252			
			"3G",												// NG CODE
			"[提示信息]\n\n副卡不能对所属主卡转账\n[INFOMATION]\nUnable to transfer from an additional \ncard to the card it attaches to.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// 252			
			"3H",												// NG CODE
			"[提示信息]\n\n交易金额超限,请到网点预约\n[INFOMATION]\nExceeds amount limit. Please make an\nappointment for the transaction at the counter.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// 252			
			"3I",												// NG CODE
			"[提示信息]\n当日密码次数超限,\n如有疑问请与发卡行联系\n[INFOMATION]\nExceeds allowable PIN tries in a day. \nPlease contact the card issuer, if you have any question.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// 252			
			"3K",												// NG CODE
			"[提示信息]\n\n交易金额已超限，请重新交易\n[INFOMATION]\nExceeds transaction amount limit. \nPlease try again.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// 253			
			"N8",												// NG CODE
			"[提示信息]\n您的卡尚未激活,\n请至网点修改密码以激活卡\n[INFOMATION]\nInactive card. Please change\nyour PIN at the counter to enable the card.",
			"",
/////////////////////////////////////////////////////////////////////////////	

			//0123456789012345678901234567890123456789			// 254		
			"N0",												// NG CODE
			"[提示信息]\n您的卡尚未开通自助设备转账功能,\n请到网点申请开通\n[INFOMATION]\nThe card is unable to transfer on ATM.\nPlease apply for the service at the counter.",
			"",//wbl
/////////////////////////////////////////////////////////////////////////////	

			//0123456789012345678901234567890123456789			// 255	
			"4F",												// NG CODE
			"[提示信息]\n\n您的卡已被吞卡,请与发卡行联系\n[INFOMATION]\nCard retained. Please contact card issuer. ",
			"",
/////////////////////////////////////////////////////////////////////////////		

			//0123456789012345678901234567890123456789			// NNN
			"79",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\nSystem maintenance. Please try again later",
			"",
/////////////////////////////////////////////////////////////////////////////		
			
			//0123456789012345678901234567890123456789			// NNN
			"ZZ",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\nSystem maintenance. Please try again later.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN		
			"5A",												// NG CODE
			"[提示信息]\n交易超时,\n如有疑问请与发卡行联系\n[INFOMATION]\nTransaction timeout. \nPlease contact card issuer. ",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5B",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\nSystem maintenance. Please try again later.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5C",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\nSystem maintenance. Please try again later.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5D",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\nSystem maintenance. Please try again later.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5E",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\nSystem maintenance. Please try again later.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5F",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\nSystem maintenance. Please try again later.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5G",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\nSystem maintenance. Please try again later.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5H",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\nSystem maintenance. Please try again later.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5I",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\nSystem maintenance. Please try again later.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5J",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\nSystem maintenance. Please try again later.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5K",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您的卡信息不合法，请至网点换卡\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5L",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您的卡信息不合法，请至网点换卡\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5M",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您的卡状态不正常，请与发卡行联系\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5N",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您的卡状态不正常，请与发卡行联系\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5O",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您的卡信息不合法，请至网点换卡\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5P",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您的卡已被吞卡，请与发卡行联系\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5Q",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\nSystem maintenance. Please try again later.",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5R",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您的卡交易异常，请至网点确认\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5S",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您的卡不能办理此交易\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5T",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您的卡不能办理此交易\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5U",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您的卡不能办理此交易\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5V",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您的卡状态不正常，请与发卡行联系\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5W",												// NG CODE(DEFAULT)
			"[提示信息]\n\n电子现金上限不能高于默认上限\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5X",												// NG CODE(DEFAULT)
			"[提示信息]\n\n电子现金上限应高于自动圈存上限\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5Y",												// NG CODE(DEFAULT)
			"[提示信息]\n\n电子现金余额上限不能为空\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"5Z",												// NG CODE(DEFAULT)
			"[提示信息]\n\n电子现金余额上限不能小于余额上限的最小值\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6A",												// NG CODE(DEFAULT)
			"[提示信息]\n\n此卡不允许修改电子现金余额上限\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6B",												// NG CODE(DEFAULT)
			"[提示信息]\n\n交易金额不能低于充值单笔交易金额下限\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6C",												// NG CODE(DEFAULT)
			"[提示信息]\n\n交易金额不能高于充值单笔交易金额上限\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6D",												// NG CODE(DEFAULT)
//			"[提示信息]\n\n实际可圈存金额为零\n[INFOMATION]\n",
			"[提示信息]\n\n交易金额不正确\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6E",												// NG CODE(DEFAULT)
			"[提示信息]\n\n交易金额不能小于零\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6F",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您的卡不能办理此交易\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6G",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您的卡状态不正常，请与发卡行联系\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6H",												// NG CODE(DEFAULT)
			"[提示信息]\n\n充值关系登记状态不正常\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6I",												// NG CODE(DEFAULT)
			"[提示信息]\n\n此卡不能办理充值业务\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6J",												// NG CODE(DEFAULT)
			"[提示信息]\n\n此卡未开通充值业务\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6K",												// NG CODE(DEFAULT)
			"[提示信息]\n\n绑定充值账户不存在\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6L",												// NG CODE(DEFAULT)
			"[提示信息]\n\n原交易非充值交易，不能做充值交易冲正\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6M",												// NG CODE(DEFAULT)
			"[提示信息]\n\n非指定账户圈存的转出卡类型不能是电子现金卡\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6N",												// NG CODE(DEFAULT)
			"[提示信息]\n\n解析发卡行脚本执行结果出错\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6O",												// NG CODE(DEFAULT)
			"[提示信息]\n\n该交易不支持跨省交易\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6P",												// NG CODE(DEFAULT)
			"[提示信息]\n\n没有符合条件的预约圈存记录\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6Q",												// NG CODE(DEFAULT)
			"[提示信息]\n\n预约圈存金额超限\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6R",												// NG CODE(DEFAULT)
			"[提示信息]\n\n预约记录已执行或已撤销\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6S",												// NG CODE(DEFAULT)
			"[提示信息]\n\n预约记录过期\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6T",												// NG CODE(DEFAULT)
			"[提示信息]\n\n预约圈存金额不足单次圈存下限\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6U",												// NG CODE(DEFAULT)
			"[提示信息]\n\n预约圈存笔数超限\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6V",												// NG CODE(DEFAULT)
			"[提示信息]\n\n非预约圈存交易\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6W",												// NG CODE(DEFAULT)
			"[提示信息]\n\n交易金额不能为空\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6X",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您的卡状态不正常，请与发卡行联系\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6Y",												// NG CODE(DEFAULT)
			"[提示信息]\n\n自动圈存值不能为空\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"6Z",												// NG CODE(DEFAULT)
			"[提示信息]\n\n单笔交易金额低于系统限制\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"7A",												// NG CODE(DEFAULT)
			"[提示信息]\n\n转入卡号不存在\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"7B",												// NG CODE(DEFAULT)
			"[提示信息]\n\n绑定充值账户已存在\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"7C",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"7D",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"7E",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"7F",												// NG CODE(DEFAULT)
			"[提示信息]\n\n无退货记录，不需要做此交易\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"7G",												// NG CODE(DEFAULT)
			"[提示信息]\n\n卡号不存在\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"7H",												// NG CODE(DEFAULT)
			"[提示信息]\n\n交易金额低于最小充值金额\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"7I",												// NG CODE(DEFAULT)
			"[提示信息]\n\n转入卡已销户，不允许进行此交易\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"7J",												// NG CODE(DEFAULT)
			"[提示信息]\n\n转入卡已销户，不允许进行此交易\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"7K",												// NG CODE(DEFAULT)
			"[提示信息]\n\n转入卡状态异常\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"7L",												// NG CODE(DEFAULT)
			"[提示信息]\n\n转出卡状态异常\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"7M",												// NG CODE(DEFAULT)
			"[提示信息]\n\n转出卡未开户\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"7N",												// NG CODE(DEFAULT)
			"[提示信息]\n\n电子现金额度上限不能低于电子现金余额\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"7O",												// NG CODE(DEFAULT)
			"[提示信息]\n\n电子现金额度上限不能小于单笔交易限额\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"97",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您的卡信息不合法，请至网点换卡\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"D4",												// NG CODE(DEFAULT)
			"[提示信息]\n\n您未开通任一电子银行，请到柜台办理\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"D3",												// NG CODE(DEFAULT)
			"[提示信息]\n\n短信验证码错误或超时，请重新做交易\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"49",												// NG CODE(DEFAULT)
			"[提示信息]\n\n无符合条件的记录\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"01",												// NG CODE(DEFAULT)
			"[提示信息]\n\n业务种类错误\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"02",												// NG CODE(DEFAULT)
			"[提示信息]\n\n该储种不允许执行此类交易\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"03",												// NG CODE(DEFAULT)
			"[提示信息]\n\n该储种不能办理代收付业务\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////

			//0123456789012345678901234567890123456789			// NNN
			"G0",												// NG CODE(DEFAULT)
			"[提示信息]\n\n对不起，该汇票不能退汇\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////
			
			//0123456789012345678901234567890123456789			// NNN
			"3J",												// NG CODE(DEFAULT)
			"[提示信息]\n\n没有交易权限\n[INFOMATION]\n",
			"",
/////////////////////////////////////////////////////////////////////////////
			
			//0123456789012345678901234567890123456789			// NNN
			"!!",												// NG CODE(DEFAULT)
			"[提示信息]\n\n通讯失败，请您稍后重试\n[INFOMATION]\nTransaction fail. Please try again later.",
			"",
/////////////////////////////////////////////////////////////////////////////
			
			//0123456789012345678901234567890123456789			// NNN
			"??",												// NG CODE(DEFAULT)
			"[提示信息]\n\n系统维护，暂不能交易，请稍候再试\n[INFOMATION]\nSystem maintenance. Please try again later.",
			""
};

/////////////////////////////////////////////////////////////////////////////
//	Transaction Code Name
/////////////////////////////////////////////////////////////////////////////
static	BYTE	TranCodeName[][17] = {
//			 01234567890123456789
			"                ",							// 0:Dummy(ENGLISH)
			"INQUIRY         ",							// 1:INQUIRY
			"TRANSFER        ",							// 2:TRANSFER
			"WITHDRAWAL      ",							// 3:WITHDRAWAL
			"CHANGEPIN       ",							// 4:CHANGEPIN
			"DETAIL          ",							// 5:DETAIL
			"PAY             ",							// 6:PAY
			"PAY_INQ         ",							// 7:PAY_INQ
			"REMIT           ",							// 8:REMIT
			"REMIT_ADD       ",							// 9:REMIT_ADD
			"REMIT_IN        ",							// 10:REMIT_IN
			"REMIT_PWD       ",							// 11:REMIT_PWD
			"REMIT_ADD_INQ   ",							// 12:REMIT_ADD_INQ
			"REMIT_IN_INQ    ",							// 13:REMIT_IN_INQ
			"REMIT_PWD_INQ   ",							// 14:REMIT_PWD_INQ

			"                "							// NNN
};

/////////////////////////////////////////////////////////////////////////////
//	IC卡交易类型列表 added by yusy ic
/////////////////////////////////////////////////////////////////////////////
static char TranICTypeTable[][2][256] = {
			"30",
			"余额查询",

			"03",
			"预授权",

			"20",
			"退款",

			"00",
			"消费",

			"01",
			"取款",

			"21",
			"存款",

			"17",
			"存款撤销",

			"40",
			"转账",

			"46",
			"转出",

			"47",
			"转入",

			"22",
			"调整",

			"02",
			"转入",

			"60",
			"指定圈存",

			"62",
			"非指圈存",

			"63",
			"现金充值",

			"19",
			"借记",

			"29",
			"贷记",

			"90",
			"卡表下载",

			"27",
			"预借撤销",

			"24",
			"账户验证",

			"50",
			"加办",

			"51",
			"撤办",

			"52",
			"代售交易",

			"41",
			"汇款",

			"53",
			"退汇",

			"54",
			"兑付入账",

			"55",
			"开户",

			"56",
			"清户",

			"57",
			"修改上限",

			"58",
			"圈存维护",

			"59",
			"户名变更",

			"70",
			"改密"
};

/////////////////////////////////////////////////////////////////////////////
//	Host Ng Message Table
/////////////////////////////////////////////////////////////////////////////
typedef struct tagPayNote
{
	int 	PayCode;
	char	PayName[20];
} PayNote;

static PayNote PayNoteTbl[] = {
	//////////////////////////////////////////////////////
	4,
	"地址汇款",
    ///////////////////////////////////////////////////////
	//////////////////////////////////////////////////////
	5,
	"密码汇款",
    ///////////////////////////////////////////////////////
	//////////////////////////////////////////////////////
	6,
	"异地本行账号汇款",
    ///////////////////////////////////////////////////////
	//////////////////////////////////////////////////////
	7,
	"同城同行汇款",
    ///////////////////////////////////////////////////////
	//////////////////////////////////////////////////////
	8,
	"同城跨行汇款",
    ///////////////////////////////////////////////////////
	//////////////////////////////////////////////////////
	9,
	"一本通汇款",
    ///////////////////////////////////////////////////////
	//////////////////////////////////////////////////////
	10,
	"异地跨行汇款",
    ///////////////////////////////////////////////////////
	//////////////////////////////////////////////////////
	11,
	"基金",
    ///////////////////////////////////////////////////////
	//////////////////////////////////////////////////////
	1001,
	"移动缴费",
    ///////////////////////////////////////////////////////
	//////////////////////////////////////////////////////
	1002,
	"联通缴费",
    ///////////////////////////////////////////////////////
	1003,
	"电信缴费",
    ///////////////////////////////////////////////////////
	1007,
	"电费",
    ///////////////////////////////////////////////////////
};

/////////////////////////////////////////////////////////////////////////////
//	Pboc Aid Table
/////////////////////////////////////////////////////////////////////////////
//	KOREA
//	FIC_AID					{ 0xD4, 0x10, 0x65, 0x09, 0x90, 0x00, 0x10 };
//	FIC_KCASH_AID			{ 0xD4, 0x10, 0x65, 0x09, 0x90, 0x00, 0x20 };
//	FIC_ICASIGN_AID			{ 0xD4, 0x10, 0x65, 0x09, 0x90, 0x00, 0x30 };
//	ELECPB_AID				{ 0xD4, 0x10, 0x65, 0x00, 0x41, 0x00, 0x02 };
//	FIC_MYBI_AID			{ 0xD4, 0x10, 0x65, 0x90, 0x10, 0x00, 0x20 };

//	EMV
//	VISA_AID				{ 0xA0, 0x00, 0x00, 0x00, 0x03, 0x10, 0x10 };// VISA(CREDIT OR CHECK)
//	ELECTRON_AID			{ 0xA0, 0x00, 0x00, 0x00, 0x03, 0x20, 0x10 };// VISA ELECTRON
//	PLUS_AID				{ 0xA0, 0x00, 0x00, 0x00, 0x03, 0x80, 0x10 };// PLUS(VSDC)
//	MASTER_AID				{ 0xA0, 0x00, 0x00, 0x00, 0x04, 0x10, 0x10 };// MASTER CARD
//	MAESTRO_AID				{ 0xA0, 0x00, 0x00, 0x00, 0x04, 0x30, 0x60 };// MAESTRO(M-CHIP)
//	CIRRUS_AID				{ 0xA0, 0x00, 0x00, 0x00, 0x04, 0x60, 0x00 };// CIRRUS(MASTER)
//	JCB_AID					{ 0xA0, 0x00, 0x00, 0x00, 0x65, 0x10, 0x10 };// JCB(JAPAN)
//	LOCALEMV_AID			{ 0xD4, 0x10, 0x00, 0x00, 0x01, 0x10, 0x10 };// KOREA(CREDIT OR CHECK)

/////////////////////////////////////////////////////////////////////////////
//	Pboc App Table
/////////////////////////////////////////////////////////////////////////////
static PBCst_APPLIST PbcAppTable[] = {
	//0123456789012345678901234567890123456789
	"",															// Local App Name
	"\xA0\x00\x00\x03\x33\x01\x01",								// 0:Aid (PBOC DEBIT)	
	7,															// 0:Aid Length
	PART_MATCH,													// Sel Flag
	0,															// Priority
	0,															// Target Per
	0,															// Max Target Per
	1,															// Floor Limit Check
	1,															// Rand Trans Sel
	1,															// Velocity Check
	0,															// Floor Limit
	0,															// Threshold
	"\x00\x10\x00\x00\x00",										// TAC Denial [6]
	"\xD8\x40\x04\xF8\x00",										// TAC Online [6]
	"\xD8\x40\x00\xA8\x00",										// TAC Default [6]
	"\x00\x00\x00\x12\x34\x56",									// Acquier Id [7]
	"\x03\x9F\x37\x04",											// dDOL [256]
	"\x0F\x9F\x02\x06\x5F\x2A\x02\x9A\x03\x9C\x01\x95\x05\x9F\x37\x04",	// tDOL [256]
	"\x00\x02",													// Version [3]
	""															// RiskManData [10]
};

/////////////////////////////////////////////////////////////////////////////
#endif
			

